stroma123/nrf51822-keyboard-geno/usb/main.c
/*
Copyright (C) 2018,2019 Jim Jiang <jim@lotlab.org>

This program is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <https://www.gnu.org/licenses/>.
*/

#include "CH554_SDCC.h"
#include "DAP_hid.h"
#include "app_timer.h"
#include "compiler.h"
#include "endpoints.h"
#include "interrupt.h"
#include "system.h"
#include "uart.h"
#include "usb_comm.h"
#include <stdbool.h>
#include <stdio.h>
#include <string.h>

bool ping_skip_next = false;

/**
 * @brief CH554 软复位
 *
 */
static void CH554SoftReset()
{
    SAFE_MOD = 0x55;
    SAFE_MOD = 0xAA;
    GLOBAL_CFG |= bSW_RESET;
}

/** \brief CH554设备模式唤醒主机，发送K信号
 *
 */
void CH554USBDevWakeup()
{
    if (usb_state.is_sleep && usb_state.remote_wake) {
        usb_state.is_sleep = false;
    	UDEV_CTRL |= bUD_LOW_SPEED;
   		DelayMs(2);
    	UDEV_CTRL &= ~bUD_LOW_SPEED;
    }
}

/** \brief CH559USB中断处理函数
 */
static INTERRUPT_USING(DeviceInterrupt, INT_NO_USB, 1) //USB中断服务程序,使用寄存器组1
{
    UsbIsr();
}

/**
 * @brief 按键发送事件
 *
 */
static void UsbOnKeySend()
{
    CH554USBDevWakeup();
    ping_skip_next = true;
}

/**
 * @brief 上传键盘通常按键数据包
 *
 * @param packet 数据包
 * @param len 长度。必须是8
 */
void KeyboardGenericUpload(uint8_t* packet, uint8_t len)
{
    if (len != 8)
        return;
    usb_state.is_busy = true;
    UsbOnKeySend();

    memcpy(&Ep1Buffer[64], packet, len);
    UEP1_T_LEN = len;
    UEP1_CTRL = UEP1_CTRL & ~MASK_UEP_T_RES | UEP_T_RES_ACK;
}

/**
 * @brief 上传键盘特殊按键数据包
 *
 * @param packet 数据包
 * @param len 长度。必须是3，第一个byte为ID
 */
void KeyboardExtraUpload(uint8_t *packet, uint8_t len)
{
    if (len != 3)
        return;
    usb_state.is_busy = true;
    UsbOnKeySend();

    memcpy(Ep2Buffer, packet, len);
    UEP2_T_LEN = len;
    UEP2_CTRL = UEP2_CTRL & ~MASK_UEP_T_RES | UEP_T_RES_ACK;
}

/**
 * @brief 响应KeyMap下载数据包
 *
 * @param packet 数据包
 * @param len 长度
 */
void ResponseConfigurePacket(uint8_t* packet, uint8_t len)
{
    if (len > 64)
        return;

    usb_state.is_busy = true;
    Ep3Buffer[64] = 0x3f; // packet id
    memcpy(&Ep3Buffer[65], packet, len);
    memset(&Ep3Buffer[65 + len], 0, 64 - len - 2);
    UEP3_T_LEN = 64;
    UEP3_CTRL = UEP3_CTRL & ~MASK_UEP_T_RES | UEP_T_RES_ACK;
}

/**
 * @brief 串口中断
 *
 */
static INTERRUPT(UARTInterrupt, INT_NO_UART1)
{
    if (U1RI) {
        uart_recv();
        // U1RI = 0;
    }
}

/**
 * @brief 端点3下传数据。下传的是Keymap数据包
 *
 */
void EP3_OUT()
{
    uint8_t checksum = 0x00;
    for (int i = 1; i < 62; i++)
    {
        checksum += Ep3Buffer[i];
    }
    Ep3Buffer[62] = checksum;
    uart_send(PACKET_KEYMAP, &Ep3Buffer[1], 62);
#if DEBUG_UART0 && DEBUG_USB_OUT
    printf_tiny("o3,");
#endif
}

/**
 * @brief 端点1下传数据，里面的是键盘LED状态
 *
 */
void EP1_OUT()
{
    uint8_t datalen = USB_RX_LEN;
    uart_send(PACKET_LED, Ep1Buffer, 1);
#if DEBUG_UART0 && DEBUG_USB_OUT
    printf_tiny("o1,");
#endif
}

/**
 * @brief 启用看门狗
 *
 */
static void EnableWatchDog()
{
    SAFE_MOD = 0x55;
    SAFE_MOD = 0xaa;        //进入安全模式
    GLOBAL_CFG |= bWDOG_EN; //启动看门狗复位
    SAFE_MOD = 0x00;        //退出安全模式
    WDOG_COUNT = 0;         //看门狗赋初值
}

/**
 * @brief 喂狗
 *
 */
static void FeedWatchDog()
{
    WDOG_COUNT = 0x00;
}

/**
 * @brief 发送Ping包用于维持UART链接
 *
 */
static void ping_packet()
{
    if (uart_rx_state == STATE_IDLE)
    {
        if (ping_skip_next)
        {
            ping_skip_next = false;
        }
        else
        {
            if (usb_state.is_ready)
                uart_send(PACKET_USB_STATE, NULL, 0);
            else
                uart_send(PACKET_PING, NULL, 0);
        }
    }
}

/** 定义定时器 */
const timer_info timers[] = {
    TIMER_DEF(&FeedWatchDog, 500),
    TIMER_DEF(&ping_packet, 500),
    TIMER_DEF(&uart_check, 1),
#ifdef ONBOARD_CMSIS_DAP
    TIMER_DEF(&Dap_Routine, 1)
#endif
};
TIMER_INIT(timer, timers)

static INTERRUPT(TimerInterrupt, INT_NO_TKEY)
{
    TKEY_CTRL = 0;
    timer_tick();
}

/**
 * @brief USB睡眠事件
 *
 */
void UsbSuspendEvt(bool suspend)
{
    usb_state.is_sleep = suspend;
}

static void main()
{
    CfgSysClock();
    DelayMs(5); //修改主频等待内部晶振稳定,必加
#ifdef DEBUG_UART0
    InitUART();  //串口0初始化
#endif
    uart_init();
    DelayMs(5);
#ifdef DEBUG_UART0
    printf_tiny("Build %s %s\n\r", __TIME__, __DATE__);
#endif
    IE_TKEY = 1; // 运行Timer
    USBDeviceInit(); //USB设备模式初始化
    EA = 1;         //允许单片机中断

    EnableWatchDog();
#ifdef ONBOARD_CMSIS_DAP
    Dap_Init();
#endif
    UEP1_T_LEN = 0; //预使用发送长度一定要清空
    UEP2_T_LEN = 0; //预使用发送长度一定要清空
    UEP3_T_LEN = 0;
    UEP4_T_LEN = 0;

    // 拉低P1.5，通知主控使用UART接收
    P1_MOD_OC -= (P1_MOD_OC & bMOSI);
    MOSI = false;

    while (1) {
        timer_task_exec();
    }
}
